# What is *Pandas?*

- Pandas is a Python library used for data manipulation, analysis, cleaning, transformation, and exploration.
- It works mainly with tabular (row-column) data.

### Installing & Importing Pandas

In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\sagar\appdata\roaming\python\python312\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\sagar\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

## Pandas Data Structures

- Pandas has two main data structures:

## Series
- A Series is a one-dimensional labeled array capable of holding data of any type.

Key characteristics:

- 1-dimensional
- Labeled index
- Can store any datatype
- Fast & optimized

### Different Ways to Create a Series (Types of Creation)

In [2]:
# From List
s = pd.Series([12,13,14,15,16])
print(s)

0    12
1    13
2    14
3    15
4    16
dtype: int64

In [3]:
# From Dict.
ss = pd.Series({ 'a':121, 'b': 131 ,'c':141})
print(ss)

a    121
b    131
c    141
dtype: int64

In [4]:
#From Numpy Data
import numpy as np 
arr = np.array([1,2,3,4])
print(arr)

[1 2 3 4]

In [5]:
sss = pd.Series(arr)
print(sss)

0    1
1    2
2    3
3    4
dtype: int32

In [7]:
#with custom Index
s = pd.Series([12,13,14,15,16], index=['s1','s2','s3','s4','s5'])
print(s)

s1    12
s2    13
s3    14
s4    15
s5    16
dtype: int64

### Series Important Attributes / Methods

In [9]:
s.index    # s.index → gives index

Index(['s1', 's2', 's3', 's4', 's5'], dtype='object')

In [10]:
s.values   #s.values → numpy array

array([12, 13, 14, 15, 16], dtype=int64)

In [11]:
s.dtype #s.dtype → datatype

dtype('int64')

In [13]:
s.head(2)   # Show 1st 2 records

s1    12
s2    13
dtype: int64

In [15]:
s.tail(2)   #show last 2 records

s4    15
s5    16
dtype: int64

In [16]:
# Math Operations
s + 2

s1    14
s2    15
s3    16
s4    17
s5    18
dtype: int64

In [17]:
s - 2

s1    10
s2    11
s3    12
s4    13
s5    14
dtype: int64

In [18]:
s * 2

s1    24
s2    26
s3    28
s4    30
s5    32
dtype: int64

In [20]:
# Filter series 
s[s > 14]

s4    15
s5    16
dtype: int64

## DataFrame (2D Table)
Definition:
- A DataFrame is a two-dimensional, mutable table-like structure with rows & columns.

- Why DataFrame?
    - You can filter data easily
    - Modify, clean, merge, transform
    - Similar to SQL + Excel + Dictionary

### Different Ways to Create a DataFrame

In [22]:
# 1.From Dict. of List
data = {
    'Name':['Vipul','Sakshi','Tanmay','Nilesh','Ramesh'],
    'marks':[23,56,45,67,44]
}
print(type(data))
print(data)

<class 'dict'>
{'Name': ['Vipul', 'Sakshi', 'Tanmay', 'Nilesh', 'Ramesh'], 'marks': [23, 56, 45, 67, 44]}

In [24]:
df = pd.DataFrame(data)
df

     Name  marks
0   Vipul     23
1  Sakshi     56
2  Tanmay     45
3  Nilesh     67
4  Ramesh     44

In [28]:
# 2.From List of Dict.
data1 = [
    {'name':"Sachin", 'age':23},
    {'name':"Suresh","age":25}
]
print(type(data1))
print(data1)

<class 'list'>
[{'name': 'Sachin', 'age': 23}, {'name': 'Suresh', 'age': 25}]

In [29]:
df = pd.DataFrame(data1)
df

     name  age
0  Sachin   23
1  Suresh   25

In [30]:
# 3.From List of List 
data = [
    [1, 'Ajay', 50000],
    [2, 'Vijay',80000],
    [3, 'Suresh',40000]
]
print(type(data))
print(data)

<class 'list'>
[[1, 'Ajay', 50000], [2, 'Vijay', 80000], [3, 'Suresh', 40000]]

In [31]:
df = pd.DataFrame(data)
df

   0       1      2
0  1    Ajay  50000
1  2   Vijay  80000
2  3  Suresh  40000

In [32]:
df = pd.DataFrame(data, columns = ['ID','Name','Salary'])
df

   ID    Name  Salary
0   1    Ajay   50000
1   2   Vijay   80000
2   3  Suresh   40000

### DataFrame Important Attributes

| Attribute      | Meaning               |
| -------------- | --------------------- |
| **df.shape**   | No. of rows & columns |
| **df.size**    | Total elements        |
| **df.ndim**    | Dimension             |
| **df.index**   | Row indexes           |
| **df.columns** | Column names          |
| **df.values**  | Numpy array           |

In [33]:
df.shape   # No. of rows & columns

(3, 3)

In [34]:
df.size  # Total Elements

9

In [35]:
df.index   # Row Indexes

RangeIndex(start=0, stop=3, step=1)

In [36]:
df.ndim

2

In [37]:
df.columns

Index(['ID', 'Name', 'Salary'], dtype='object')

In [38]:
df.values

array([[1, 'Ajay', 50000],
       [2, 'Vijay', 80000],
       [3, 'Suresh', 40000]], dtype=object)

### Reading and Writing Files

In [4]:
import pandas as pd
df = pd.read_csv("C:/Users/sagar/Desktop/All Data/Data Sci/csv files/50_Startups.csv")
df.head(2)

        RND      ADMIN        MKT       STATE     PROFIT
0  165349.2  136897.80  471784.10    New York  192261.83
1  162597.7  151377.59  443898.53  California  191792.06

### Selecting Data
*Column Selection*

In [5]:
# Single column
df['RND'].head()

0    165349.20
1    162597.70
2    153441.51
3    144372.41
4    142107.34
Name: RND, dtype: float64

In [7]:
# Multiple  Columns 
df[['RND','MKT']].head()

         RND        MKT
0  165349.20  471784.10
1  162597.70  443898.53
2  153441.51  407934.54
3  144372.41  383199.62
4  142107.34  366168.42

*Row Selection*

In [8]:
#Using loc (label-based)
df.loc[0]

RND        165349.2
ADMIN      136897.8
MKT        471784.1
STATE      New York
PROFIT    192261.83
Name: 0, dtype: object

In [9]:
df.loc[0:3]

         RND      ADMIN        MKT       STATE     PROFIT
0  165349.20  136897.80  471784.10    New York  192261.83
1  162597.70  151377.59  443898.53  California  191792.06
2  153441.51  101145.55  407934.54     Florida  191050.39
3  144372.41  118671.85  383199.62    New York  182901.99

In [12]:
df.loc[:, "RND"].head()

0    165349.20
1    162597.70
2    153441.51
3    144372.41
4    142107.34
Name: RND, dtype: float64

In [13]:
df.loc[0:3, ["RND", "PROFIT"]]

         RND     PROFIT
0  165349.20  192261.83
1  162597.70  191792.06
2  153441.51  191050.39
3  144372.41  182901.99

In [14]:
#Using iloc (index-based)

df.iloc[0]

RND        165349.2
ADMIN      136897.8
MKT        471784.1
STATE      New York
PROFIT    192261.83
Name: 0, dtype: object

In [15]:
df.iloc[0:3]

         RND      ADMIN        MKT       STATE     PROFIT
0  165349.20  136897.80  471784.10    New York  192261.83
1  162597.70  151377.59  443898.53  California  191792.06
2  153441.51  101145.55  407934.54     Florida  191050.39

In [17]:
df.iloc[:, 1].head()

0    136897.80
1    151377.59
2    101145.55
3    118671.85
4     91391.77
Name: ADMIN, dtype: float64

In [18]:
df.iloc[0:3, 1:3]

       ADMIN        MKT
0  136897.80  471784.10
1  151377.59  443898.53
2  101145.55  407934.54

### Filtering

In [20]:
#Basic Condition.
df[df["PROFIT"] < 191792.06].head()

         RND      ADMIN        MKT       STATE     PROFIT
2  153441.51  101145.55  407934.54     Florida  191050.39
3  144372.41  118671.85  383199.62    New York  182901.99
4  142107.34   91391.77  366168.42     Florida  166187.94
5  131876.90   99814.71  362861.36    New York  156991.12
6  134615.46  147198.87  127716.82  California  156122.51

In [21]:
#Multiple Conditions :- 1. AND ( & )
df[(df["PROFIT"] < 191792.06) & (df["STATE"] == "New York")]

          RND      ADMIN        MKT     STATE     PROFIT
3   144372.41  118671.85  383199.62  New York  182901.99
5   131876.90   99814.71  362861.36  New York  156991.12
8   120542.52  148718.95  311613.29  New York  152211.77
15  114523.61  122616.84  261776.23  New York  129917.04
17   94657.16  145077.58  282574.31  New York  125370.37
19   86419.70  153514.11       0.00  New York  122776.86
21   78389.47  153773.43  299737.29  New York  111313.02
24   77044.01   99281.34  140574.81  New York  108552.04
27   72107.60  127864.55  353183.81  New York  105008.31
29   65605.48  153032.06  107138.38  New York  101004.64
31   61136.38  152701.92   88218.23  New York   97483.56
35   46014.02   85047.44  205517.64  New York   96479.51
38   20229.59   65947.93  185265.10  New York   81229.06
43   15505.73  127382.30   35534.17  New York   69758.98
45    1000.23  124153.04    1903.93  New York   64926.08
48     542.05   51743.15       0.00  New York   35673.41

In [23]:
# 2. OR ( | )
df[(df["PROFIT"] < 191792.06) | (df["STATE"] == "New York")]

          RND      ADMIN        MKT       STATE     PROFIT
0   165349.20  136897.80  471784.10    New York  192261.83
2   153441.51  101145.55  407934.54     Florida  191050.39
3   144372.41  118671.85  383199.62    New York  182901.99
4   142107.34   91391.77  366168.42     Florida  166187.94
5   131876.90   99814.71  362861.36    New York  156991.12
6   134615.46  147198.87  127716.82  California  156122.51
7   130298.13  145530.06  323876.68     Florida  155752.60
8   120542.52  148718.95  311613.29    New York  152211.77
9   123334.88  108679.17  304981.62  California  149759.96
10  101913.08  110594.11  229160.95     Florida  146121.95
11  100671.96   91790.61  249744.55  California  144259.40
12   93863.75  127320.38  249839.44     Florida  141585.52
13   91992.39  135495.07  252664.93  California  134307.35
14  119943.24  156547.42  256512.92     Florida  132602.65
15  114523.61  122616.84  261776.23    New York  129917.04
16   78013.11  121597.55  264346.06  California  126992.93
17   94657.16  145077.58  282574.31    New York  125370.37
18   91749.16  114175.79  294919.57     Florida  124266.90
19   86419.70  153514.11       0.00    New York  122776.86
20   76253.86  113867.30  298664.47  California  118474.03
21   78389.47  153773.43  299737.29    New York  111313.02
22   73994.56  122782.75  303319.26     Florida  110352.25
23   67532.53  105751.03  304768.73     Florida  108733.99
24   77044.01   99281.34  140574.81    New York  108552.04
25   64664.71  139553.16  137962.62  California  107404.34
26   75328.87  144135.98  134050.07     Florida  105733.54
27   72107.60  127864.55  353183.81    New York  105008.31
28   66051.52  182645.56  118148.20     Florida  103282.38
29   65605.48  153032.06  107138.38    New York  101004.64
30   61994.48  115641.28   91131.24     Florida   99937.59
31   61136.38  152701.92   88218.23    New York   97483.56
32   63408.86  129219.61   46085.25  California   97427.84
33   55493.95  103057.49  214634.81     Florida   96778.92
34   46426.07  157693.92  210797.67  California   96712.80
35   46014.02   85047.44  205517.64    New York   96479.51
36   28663.76  127056.21  201126.82     Florida   90708.19
37   44069.95   51283.14  197029.42  California   89949.14
38   20229.59   65947.93  185265.10    New York   81229.06
39   38558.51   82982.09  174999.30  California   81005.76
40   28754.33  118546.05  172795.67  California   78239.91
41   27892.92   84710.77  164470.71     Florida   77798.83
42   23640.93   96189.63  148001.11  California   71498.49
43   15505.73  127382.30   35534.17    New York   69758.98
44   22177.74  154806.14   28334.72  California   65200.33
45    1000.23  124153.04    1903.93    New York   64926.08
46    1315.46  115816.21  297114.46     Florida   49490.75
47       0.00  135426.92       0.00  California   42559.73
48     542.05   51743.15       0.00    New York   35673.41
49       0.00  116983.80   45173.06  California   14681.40

In [25]:
# 3.NOT (~)
df[~ (df["STATE"] == "New York")]

          RND      ADMIN        MKT       STATE     PROFIT
1   162597.70  151377.59  443898.53  California  191792.06
2   153441.51  101145.55  407934.54     Florida  191050.39
4   142107.34   91391.77  366168.42     Florida  166187.94
6   134615.46  147198.87  127716.82  California  156122.51
7   130298.13  145530.06  323876.68     Florida  155752.60
9   123334.88  108679.17  304981.62  California  149759.96
10  101913.08  110594.11  229160.95     Florida  146121.95
11  100671.96   91790.61  249744.55  California  144259.40
12   93863.75  127320.38  249839.44     Florida  141585.52
13   91992.39  135495.07  252664.93  California  134307.35
14  119943.24  156547.42  256512.92     Florida  132602.65
16   78013.11  121597.55  264346.06  California  126992.93
18   91749.16  114175.79  294919.57     Florida  124266.90
20   76253.86  113867.30  298664.47  California  118474.03
22   73994.56  122782.75  303319.26     Florida  110352.25
23   67532.53  105751.03  304768.73     Florida  108733.99
25   64664.71  139553.16  137962.62  California  107404.34
26   75328.87  144135.98  134050.07     Florida  105733.54
28   66051.52  182645.56  118148.20     Florida  103282.38
30   61994.48  115641.28   91131.24     Florida   99937.59
32   63408.86  129219.61   46085.25  California   97427.84
33   55493.95  103057.49  214634.81     Florida   96778.92
34   46426.07  157693.92  210797.67  California   96712.80
36   28663.76  127056.21  201126.82     Florida   90708.19
37   44069.95   51283.14  197029.42  California   89949.14
39   38558.51   82982.09  174999.30  California   81005.76
40   28754.33  118546.05  172795.67  California   78239.91
41   27892.92   84710.77  164470.71     Florida   77798.83
42   23640.93   96189.63  148001.11  California   71498.49
44   22177.74  154806.14   28334.72  California   65200.33
46    1315.46  115816.21  297114.46     Florida   49490.75
47       0.00  135426.92       0.00  California   42559.73
49       0.00  116983.80   45173.06  California   14681.40

### Add / Update / Delete

In [26]:
#add columns

df["New_Profit"] = df['PROFIT'] + 12000
df.head(2)

        RND      ADMIN        MKT       STATE     PROFIT  New_Profit
0  165349.2  136897.80  471784.10    New York  192261.83   204261.83
1  162597.7  151377.59  443898.53  California  191792.06   203792.06

In [27]:
# Update Columns
df["PROFIT"] = df['PROFIT'] + 12000
df.head(2)

        RND      ADMIN        MKT       STATE     PROFIT  New_Profit
0  165349.2  136897.80  471784.10    New York  204261.83   204261.83
1  162597.7  151377.59  443898.53  California  203792.06   203792.06

In [28]:
#Delete Columns
df.drop("New_Profit", axis=1, inplace=True)
df.head(2)

        RND      ADMIN        MKT       STATE     PROFIT
0  165349.2  136897.80  471784.10    New York  204261.83
1  162597.7  151377.59  443898.53  California  203792.06

In [29]:
#Delete Row
df.drop(0, axis=0, inplace=True)
df.head(5)

         RND      ADMIN        MKT       STATE     PROFIT
1  162597.70  151377.59  443898.53  California  203792.06
2  153441.51  101145.55  407934.54     Florida  203050.39
3  144372.41  118671.85  383199.62    New York  194901.99
4  142107.34   91391.77  366168.42     Florida  178187.94
5  131876.90   99814.71  362861.36    New York  168991.12

### Handling Missing Values

In [30]:
# 1. Check Missing
df.isnull()

      RND  ADMIN    MKT  STATE  PROFIT
1   False  False  False  False   False
2   False  False  False  False   False
3   False  False  False  False   False
4   False  False  False  False   False
5   False  False  False  False   False
6   False  False  False  False   False
7   False  False  False  False   False
8   False  False  False  False   False
9   False  False  False  False   False
10  False  False  False  False   False
11  False  False  False  False   False
12  False  False  False  False   False
13  False  False  False  False   False
14  False  False  False  False   False
15  False  False  False  False   False
16  False  False  False  False   False
17  False  False  False  False   False
18  False  False  False  False   False
19  False  False  False  False   False
20  False  False  False  False   False
21  False  False  False  False   False
22  False  False  False  False   False
23  False  False  False  False   False
24  False  False  False  False   False
25  False  False  False  False   False
26  False  False  False  False   False
27  False  False  False  False   False
28  False  False  False  False   False
29  False  False  False  False   False
30  False  False  False  False   False
31  False  False  False  False   False
32  False  False  False  False   False
33  False  False  False  False   False
34  False  False  False  False   False
35  False  False  False  False   False
36  False  False  False  False   False
37  False  False  False  False   False
38  False  False  False  False   False
39  False  False  False  False   False
40  False  False  False  False   False
41  False  False  False  False   False
42  False  False  False  False   False
43  False  False  False  False   False
44  False  False  False  False   False
45  False  False  False  False   False
46  False  False  False  False   False
47  False  False  False  False   False
48  False  False  False  False   False
49  False  False  False  False   False

In [31]:
df.isnull().sum()

RND       0
ADMIN     0
MKT       0
STATE     0
PROFIT    0
dtype: int64

In [33]:
df.notnull().sum()

RND       49
ADMIN     49
MKT       49
STATE     49
PROFIT    49
dtype: int64

In [35]:
df.isna().sum()

RND       0
ADMIN     0
MKT       0
STATE     0
PROFIT    0
dtype: int64

## GroupBy
### What is GroupBy? (Definition)

GroupBy in Pandas is used to:

    1️⃣ Split the data → into groups
    2️⃣ Apply a function → sum(), mean(), count(), max(), min() etc
    3️⃣ Combine results 

### Why we use GroupBy?
   - Summarization
   - Aggregation
   - Data analysis
   - Pivot like operations
   - Category-based calculations
   - Reports generation (city-wise, product-wise, employee-wise etc.)

Syntax 
df.groupby("column_name")

In [19]:
df = pd.read_csv('50_Startups.csv')
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [20]:
#Total Profit by State.
df.groupby("State")["Profit"].sum()

State
California    1766387.98
Florida       1900384.39
New York      1933859.59
Name: Profit, dtype: float64

In [21]:
# Average Profit by State
df.groupby("State")["Profit"].mean()

State
California    103905.175294
Florida       118774.024375
New York      113756.446471
Name: Profit, dtype: float64

In [22]:
#Max Profit in each State.
df.groupby("State")["Profit"].max()

State
California    191792.06
Florida       191050.39
New York      192261.83
Name: Profit, dtype: float64

In [23]:
#Min Profit in each State.
df.groupby("State")["Profit"].min()

State
California    14681.40
Florida       49490.75
New York      35673.41
Name: Profit, dtype: float64

In [24]:
#Total R&D Spend by State.
df.groupby("State")["R&D Spend"].sum()

State
California    1099180.46
Florida       1291584.26
New York      1295316.06
Name: R&D Spend, dtype: float64

In [25]:
#Average Marketing Spend by State.
df.groupby("State")["Marketing Spend"].mean()

State
California    182540.929412
Florida       247323.551250
New York      205346.015882
Name: Marketing Spend, dtype: float64

In [26]:
#Count Startups per State.
df.groupby("State")["Profit"].count()

State
California    17
Florida       16
New York      17
Name: Profit, dtype: int64

In [27]:
# Multiple Aggregations on Profit.
df.groupby("State")["Profit"].agg(["sum", "mean", "max", "min"])

                   sum           mean        max       min
State
California  1766387.98  103905.175294  191792.06  14681.40
Florida     1900384.39  118774.024375  191050.39  49490.75
New York    1933859.59  113756.446471  192261.83  35673.41

In [28]:
#Multiple Columns Aggregation.
df.groupby("State").agg({
    "R&D Spend": "mean",
    "Marketing Spend": "sum",
    "Profit": "mean"
})

               R&D Spend  Marketing Spend         Profit
State
California  64657.674118       3103195.80  103905.175294
Florida     80724.016250       3957176.82  118774.024375
New York    76195.062353       3490882.27  113756.446471

In [29]:
#Profit Variance per State.
df.groupby("State")["Profit"].var()

State
California    1.975479e+09
Florida       1.267750e+09
New York      1.692521e+09
Name: Profit, dtype: float64

## sort_values() 
- used to sort rows based on one or more column values, in ascending or descending order.

Syntax :- 
df.sort_values(by='column_name')

In [33]:
# Sort by Profit (Ascending).
df.sort_values(by='Profit').head()

    R&D Spend  Administration  Marketing Spend       State    Profit
49       0.00       116983.80         45173.06  California  14681.40
48     542.05        51743.15             0.00    New York  35673.41
47       0.00       135426.92             0.00  California  42559.73
46    1315.46       115816.21        297114.46     Florida  49490.75
45    1000.23       124153.04          1903.93    New York  64926.08

In [35]:
# Sort by Profit Discending 
df.sort_values(by='Profit', ascending=False).head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [31]:
#Sort Multiple Columns
df.sort_values(by=['State', 'Profit']).head()

    R&D Spend  Administration  Marketing Spend       State    Profit
49       0.00       116983.80         45173.06  California  14681.40
47       0.00       135426.92             0.00  California  42559.73
44   22177.74       154806.14         28334.72  California  65200.33
42   23640.93        96189.63        148001.11  California  71498.49
40   28754.33       118546.05        172795.67  California  78239.91

In [36]:
#Sort Multiple Columns
df.sort_values(by=['State', 'Profit'],ascending=[False, True]).head()

    R&D Spend  Administration  Marketing Spend     State    Profit
48     542.05        51743.15             0.00  New York  35673.41
45    1000.23       124153.04          1903.93  New York  64926.08
43   15505.73       127382.30         35534.17  New York  69758.98
38   20229.59        65947.93        185265.10  New York  81229.06
35   46014.02        85047.44        205517.64  New York  96479.51

### Merging / Joining / Concatenation

## 1. CONCATENATION (pd.concat())
- Concatenation means combining DataFrames along rows or columns without using keys or common columns.

Syntax :- 
pd.concat([df1, df2], axis=0)

In [37]:
df1 = df[0:25]
df2 = df[26:]

In [38]:
df1.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [39]:
df2.head()

    R&D Spend  Administration  Marketing Spend     State     Profit
26   75328.87       144135.98        134050.07   Florida  105733.54
27   72107.60       127864.55        353183.81  New York  105008.31
28   66051.52       182645.56        118148.20   Florida  103282.38
29   65605.48       153032.06        107138.38  New York  101004.64
30   61994.48       115641.28         91131.24   Florida   99937.59

In [42]:
df_final = pd.concat([df1, df2], axis=0)
df_final.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

### 2. MERGING (pd.merge())
- Merging is used to combine DataFrames based on common columns or keys, like SQL joins

Syntax :- 
pd.merge(df1, df2, on='key')

| Merge Type | Meaning                                            |
| ---------- | -------------------------------------------------- |
| **inner**  | Returns only matching records                      |
| **left**   | Returns all records from left + matches from right |
| **right**  | Returns all records from right + matches from left |
| **outer**  | Returns all records from both sides                |

In [47]:
dept = pd.read_csv('dept.csv')
dept

   dept_id dname
0       10    HR
1       20   MKT
2       30   SAL
3       40   ADM
4       50   FIN
5       60   ACC

In [46]:
emp = pd.read_csv("emp_2.csv")
emp

   empid      fn        ln     sal  did
0    101   Naman     Singh    5000   20
1    102   Raman  Tripathi    7000   20
2    103  Chaman     Nagor    8000   20
3    104   Nisha     Patil    9000   30
4    105   Madhu     Reddy   10000   30
5    106   Rahul   Barkade  122746  113

In [51]:
#1. INNER MERGE.
pd.merge(emp,dept, left_on = "did", right_on ="dept_id", how="inner")

   empid      fn        ln    sal  did  dept_id dname
0    101   Naman     Singh   5000   20       20   MKT
1    102   Raman  Tripathi   7000   20       20   MKT
2    103  Chaman     Nagor   8000   20       20   MKT
3    104   Nisha     Patil   9000   30       30   SAL
4    105   Madhu     Reddy  10000   30       30   SAL

In [52]:
#2. LEFT MERGE
pd.merge(emp,dept, left_on = "did", right_on ="dept_id", how="left")

   empid      fn        ln     sal  did  dept_id dname
0    101   Naman     Singh    5000   20     20.0   MKT
1    102   Raman  Tripathi    7000   20     20.0   MKT
2    103  Chaman     Nagor    8000   20     20.0   MKT
3    104   Nisha     Patil    9000   30     30.0   SAL
4    105   Madhu     Reddy   10000   30     30.0   SAL
5    106   Rahul   Barkade  122746  113      NaN   NaN

In [53]:
#3. Right MERGE
pd.merge(emp,dept, left_on = "did", right_on ="dept_id", how="right")

   empid      fn        ln      sal   did  dept_id dname
0    NaN     NaN       NaN      NaN   NaN       10    HR
1  101.0   Naman     Singh   5000.0  20.0       20   MKT
2  102.0   Raman  Tripathi   7000.0  20.0       20   MKT
3  103.0  Chaman     Nagor   8000.0  20.0       20   MKT
4  104.0   Nisha     Patil   9000.0  30.0       30   SAL
5  105.0   Madhu     Reddy  10000.0  30.0       30   SAL
6    NaN     NaN       NaN      NaN   NaN       40   ADM
7    NaN     NaN       NaN      NaN   NaN       50   FIN
8    NaN     NaN       NaN      NaN   NaN       60   ACC

In [54]:
#4. Full Outer MERGE
pd.merge(emp,dept, left_on = "did", right_on ="dept_id", how="outer")

   empid      fn        ln       sal    did  dept_id dname
0    NaN     NaN       NaN       NaN    NaN     10.0    HR
1  101.0   Naman     Singh    5000.0   20.0     20.0   MKT
2  102.0   Raman  Tripathi    7000.0   20.0     20.0   MKT
3  103.0  Chaman     Nagor    8000.0   20.0     20.0   MKT
4  104.0   Nisha     Patil    9000.0   30.0     30.0   SAL
5  105.0   Madhu     Reddy   10000.0   30.0     30.0   SAL
6    NaN     NaN       NaN       NaN    NaN     40.0   ADM
7    NaN     NaN       NaN       NaN    NaN     50.0   FIN
8    NaN     NaN       NaN       NaN    NaN     60.0   ACC
9  106.0   Rahul   Barkade  122746.0  113.0      NaN   NaN

### 3. JOINING (df.join())
- Join is used to combine DataFrames based on index.
- It is similar to SQL JOIN but index-based.

| Feature     | Concat               | Merge                       | Join             |
| ----------- | -------------------- | --------------------------- | ---------------- |
| Based On    | Axis                 | Keys/Columns                | Index            |
| Similar To  | Stacking tables      | SQL Merge                   | SQL Join         |
| Purpose     | Combine rows/columns | Combine by matching columns | Combine by index |
| Flexibility | Medium               | Highest                     | Medium           |

Syntax :- 
df1.join(df2)

In [59]:
data = pd.read_csv('50_Startups.csv')
data.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [63]:
tax_df = pd.DataFrame({
    'State': ['California', 'New York', 'Florida'],
    'Tax_Rate': [0.15, 0.18, 0.12]
})

tax_df

        State  Tax_Rate
0  California      0.15
1    New York      0.18
2     Florida      0.12

In [66]:
df1 = data.set_index("State")
df1.head()

            R&D Spend  Administration  Marketing Spend     Profit
State
New York    165349.20       136897.80        471784.10  192261.83
California  162597.70       151377.59        443898.53  191792.06
Florida     153441.51       101145.55        407934.54  191050.39
New York    144372.41       118671.85        383199.62  182901.99
Florida     142107.34        91391.77        366168.42  166187.94

In [67]:
tax_df1 = tax_df.set_index("State")
tax_df1

            Tax_Rate
State
California      0.15
New York        0.18
Florida         0.12

In [69]:
join_result = df1.join(tax_df1)
join_result

            R&D Spend  Administration  Marketing Spend     Profit  Tax_Rate
State
New York    165349.20       136897.80        471784.10  192261.83      0.18
California  162597.70       151377.59        443898.53  191792.06      0.15
Florida     153441.51       101145.55        407934.54  191050.39      0.12
New York    144372.41       118671.85        383199.62  182901.99      0.18
Florida     142107.34        91391.77        366168.42  166187.94      0.12
New York    131876.90        99814.71        362861.36  156991.12      0.18
California  134615.46       147198.87        127716.82  156122.51      0.15
Florida     130298.13       145530.06        323876.68  155752.60      0.12
New York    120542.52       148718.95        311613.29  152211.77      0.18
California  123334.88       108679.17        304981.62  149759.96      0.15
Florida     101913.08       110594.11        229160.95  146121.95      0.12
California  100671.96        91790.61        249744.55  144259.40      0.15
Florida      93863.75       127320.38        249839.44  141585.52      0.12
California   91992.39       135495.07        252664.93  134307.35      0.15
Florida     119943.24       156547.42        256512.92  132602.65      0.12
New York    114523.61       122616.84        261776.23  129917.04      0.18
California   78013.11       121597.55        264346.06  126992.93      0.15
New York     94657.16       145077.58        282574.31  125370.37      0.18
Florida      91749.16       114175.79        294919.57  124266.90      0.12
New York     86419.70       153514.11             0.00  122776.86      0.18
California   76253.86       113867.30        298664.47  118474.03      0.15
New York     78389.47       153773.43        299737.29  111313.02      0.18
Florida      73994.56       122782.75        303319.26  110352.25      0.12
Florida      67532.53       105751.03        304768.73  108733.99      0.12
New York     77044.01        99281.34        140574.81  108552.04      0.18
California   64664.71       139553.16        137962.62  107404.34      0.15
Florida      75328.87       144135.98        134050.07  105733.54      0.12
New York     72107.60       127864.55        353183.81  105008.31      0.18
Florida      66051.52       182645.56        118148.20  103282.38      0.12
New York     65605.48       153032.06        107138.38  101004.64      0.18
Florida      61994.48       115641.28         91131.24   99937.59      0.12
New York     61136.38       152701.92         88218.23   97483.56      0.18
California   63408.86       129219.61         46085.25   97427.84      0.15
Florida      55493.95       103057.49        214634.81   96778.92      0.12
California   46426.07       157693.92        210797.67   96712.80      0.15
New York     46014.02        85047.44        205517.64   96479.51      0.18
Florida      28663.76       127056.21        201126.82   90708.19      0.12
California   44069.95        51283.14        197029.42   89949.14      0.15
New York     20229.59        65947.93        185265.10   81229.06      0.18
California   38558.51        82982.09        174999.30   81005.76      0.15
California   28754.33       118546.05        172795.67   78239.91      0.15
Florida      27892.92        84710.77        164470.71   77798.83      0.12
California   23640.93        96189.63        148001.11   71498.49      0.15
New York     15505.73       127382.30         35534.17   69758.98      0.18
California   22177.74       154806.14         28334.72   65200.33      0.15
New York      1000.23       124153.04          1903.93   64926.08      0.18
Florida       1315.46       115816.21        297114.46   49490.75      0.12
California       0.00       135426.92             0.00   42559.73      0.15
New York       542.05        51743.15             0.00   35673.41      0.18
California       0.00       116983.80         45173.06   14681.40      0.15

In [70]:
#OUTER JOIN using join()
outer_join = df1.join(tax_df1, how='outer')
outer_join.head()

            R&D Spend  Administration  Marketing Spend     Profit  Tax_Rate
State
California  162597.70       151377.59        443898.53  191792.06      0.15
California  134615.46       147198.87        127716.82  156122.51      0.15
California  123334.88       108679.17        304981.62  149759.96      0.15
California  100671.96        91790.61        249744.55  144259.40      0.15
California   91992.39       135495.07        252664.93  134307.35      0.15